gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_8000.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_ACTION_8000.h"
#include "../DL698/DL698_ACTION_6000.h"

#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_SETLIB.h"
#include "../DL698/Contrl_Manage.h"
#include "../DL698/EVENT_Record.h"




//遥控
u32 ACTION_8000(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 x;
	u32 y;
	u32 n;
	u32 f;
	u32 OAD;
	u8* p8;
	u8* p8d;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	
	LenRx=Get_DL698DataLen_S(p8rx+4,0);//得到DL698数据类型长度(包括:类型字节和数据)
	if(p8rx[4+LenRx]==0)
	{//无时间标签
		UARTCtrl->DAR=32;//时间标签无效          (32)
		return (LenRx<<16)+LenTx;
	}
	i=Uart_TimeTag(p8rx+4+LenRx+1);//时间标签有效性判断;入口:p8rx指向时间标签;返回:0=有效,1=无效
	if(i)
	{
		UARTCtrl->DAR=32;//时间标签无效          (32)
		return (LenRx<<16)+LenTx;
	}
	
	i=p8rx[2];
	switch(i)
	{
		case 127://方法127：触发告警（参数）参数∷=NULL
			MC(0x55,ADDR_8000_127,1);
			return (LenRx<<16)+LenTx;
		case 128://方法128：解除报警（参数）参数∷=NULL
			MC(0,ADDR_8000_127,1);
			return (LenRx<<16)+LenTx;
		case 129://方法129：跳闸（参数）参数∷=array structure
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			if(i>LENmax_8000_129)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
			//读原跳闸参数
			MR(ADDR_DATABUFF,ADDR_8000_129,LENmax_8000_129);
			p8=p8rx;
			n=p8[1];//当前命令数组数
			if(n>NUMmax_CR)
			{
				n=NUMmax_CR;
			}
			p8+=2;
			while(n--)
			{
				OAD=(p8[3]<<24)|(p8[4]<<16)|(p8[5]<<8)|p8[6];//继电器OAD
				//限电时间
				i=OAD&0xff;//继电器号
				if((i!=0)&&(i<=NUMmax_CR))
				{
					i--;
					x=(p8[10]<<8)|p8[11];//限电时间    long-unsigned（单位：分钟，换算：0；值为0表示永久限电）
					if(x)
					{//有限电时间
						MWR(x,ADDR_TerminalFMTimer+6+(TFMSTIMER_NUM*2)+22+(i*2),2);
					}
				}
				p8d=(u8*)ADDR_DATABUFF;
				x=p8d[1];//数组数
				if(x>NUMmax_CR)
				{
					x=NUMmax_CR;
					p8d[1]=x;//数组数
				}
				p8d+=2;
				for(i=0;i<x;i++)
				{
					f=(p8d[3]<<24)|(p8d[4]<<16)|(p8d[5]<<8)|p8d[6];//继电器OAD
					if(f==OAD)
					{//原已经有
						MW((u32)p8,(u32)p8d,LENper_8000_129);
						break;
					}
					p8d+=LENper_8000_129;
				}
				if(i>=x)
				{//没找到
					x++;//数组数+1
					if(x<=NUMmax_CR)
					{
						MW((u32)p8,(u32)p8d,LENper_8000_129);
						p8d=(u8*)ADDR_DATABUFF;
						p8d[0]=DataType_array;
						p8d[1]=x;//数组数
					}
				}
				i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
				p8+=i;
			}
			MW(ADDR_DATABUFF,ADDR_8000_129,LENmax_8000_129);

			//修改合闸参数
			f=0;//合闸参数变化标志
			MR(ADDR_DATABUFF,ADDR_8000_130,LENmax_8000_130);
			n=p8rx[1];//数组数
			if(n>NUMmax_CR)
			{
				n=NUMmax_CR;
			}
			p8rx+=2;
			while(n--)
			{
				OAD=(p8rx[3]<<24)|(p8rx[4]<<16)|(p8rx[5]<<8)|p8rx[6];//继电器OAD
				p8=(u8*)ADDR_DATABUFF;
				x=p8[1];//数组数
				if(x>NUMmax_CR)
				{
					x=NUMmax_CR;
					p8[1]=x;//数组数
				}
				p8+=2;
				for(y=0;y<x;y++)
				{
					i=(p8[3]<<24)|(p8[4]<<16)|(p8[5]<<8)|p8[6];//继电器OAD
					if(i==OAD)
					{
						//删除合闸参数
						i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
						MR((u32)p8,((u32)p8)+i,LENmax_8000_130);
						x--;
						p8=(u8*)ADDR_DATABUFF;
						p8[1]=x;//数组数
						f=1;//参数变化标志
//						p8[3]=0;
//						p8[4]=0;
//						p8[5]=0;
//						p8[6]=0;
						break;
					}
					i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
					p8+=i;
				}
				i=Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据)
				p8rx+=i;
			}
			if(f)
			{//参数变化标志
				MW(ADDR_DATABUFF,ADDR_8000_130,LENmax_8000_130);
			}

		#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			Terminal_Remote_Control();//终端控制-遥控跳闸
		#endif
		#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
			{
				Terminal_Remote_Control();//终端控制-遥控跳闸
			}
		#endif
			return (LenRx<<16)+LenTx;
		case 130://方法130：合闸（参数）参数∷=array structure
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			if(i>LENmax_8000_130)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+LenTx;
			}
			//读原合闸参数
			MR(ADDR_DATABUFF,ADDR_8000_130,LENmax_8000_130);
			p8=p8rx;
			n=p8[1];//当前命令数组数
			p8+=2;
			while(n--)
			{
				OAD=(p8[3]<<24)|(p8[4]<<16)|(p8[5]<<8)|p8[6];//继电器OAD
				p8d=(u8*)ADDR_DATABUFF;
				x=p8d[1];//数组数
				p8d+=2;
				for(i=0;i<x;i++)
				{
					f=(p8d[3]<<24)|(p8d[4]<<16)|(p8d[5]<<8)|p8d[6];//继电器OAD
					if(f==OAD)
					{
						
						break;
					}
					f=Get_DL698DataLen_S(p8d,0);//得到DL698数据类型长度(包括:类型字节和数据)
					p8d+=f;
				}
				if(i>=x)
				{//没找到
					x++;//数组数+1
					if(x<=NUMmax_CR)
					{
						i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
						MW((u32)p8,(u32)p8d,i);
						p8d=(u8*)ADDR_DATABUFF;
						p8d[0]=DataType_array;
						p8d[1]=x;//数组数
					}
				}
				i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
				p8+=i;
			}
			MW(ADDR_DATABUFF,ADDR_8000_130,LENmax_8000_130);

			//修改跳闸参数
			f=0;//跳闸参数变化标志
			MR(ADDR_DATABUFF,ADDR_8000_129,LENmax_8000_129);
			n=p8rx[1];//数组数
			if(n>NUMmax_CR)
			{
				n=NUMmax_CR;
			}
			p8rx+=2;
			while(n--)
			{
				OAD=(p8rx[3]<<24)|(p8rx[4]<<16)|(p8rx[5]<<8)|p8rx[6];//继电器OAD
				p8=(u8*)ADDR_DATABUFF;
				x=p8[1];//数组数
				if(x>NUMmax_CR)
				{
					x=NUMmax_CR;
					p8[1]=x;//数组数
				}
				p8+=2;
				for(y=0;y<x;y++)
				{
					i=(p8[3]<<24)|(p8[4]<<16)|(p8[5]<<8)|p8[6];//继电器OAD
					if(i==OAD)
					{
						//删除跳闸参数
						f=1;//参数变化标志
						MR((u32)p8,((u32)p8)+LENper_8000_129,LENmax_8000_129);
						x--;
						p8=(u8*)ADDR_DATABUFF;
						p8[1]=x;//数组数
						break;
					}
					p8+=LENper_8000_129;
				}
				i=Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据)
				p8rx+=i;
			}
			if(f)
			{//参数变化标志
				MW(ADDR_DATABUFF,ADDR_8000_129,LENmax_8000_129);
			}
		#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			Terminal_Remote_Control();//终端控制-遥控跳闸
		#endif
		#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
			{
				Terminal_Remote_Control();//终端控制-遥控跳闸
			}
		#endif
			return (LenRx<<16)+LenTx;
		case 131://方法131：电表明文合闸（参数） 参数∷=array structure
	#if (Project/100)<=2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			if(i>LENmax_8000_130)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
			MW((u32)p8rx,ADDR_8000_130,i);
			//修改跳闸参数
			f=0;//跳闸参数变化标志
			MR(ADDR_DATABUFF,ADDR_8000_129,LENmax_8000_129);
			n=p8rx[1];//数组数
			p8rx+=2;
			while(n--)
			{
				OAD=(p8rx[3]<<24)|(p8rx[4]<<16)|(p8rx[5]<<8)|p8rx[6];//继电器OAD
				p8=(u8*)ADDR_DATABUFF;
				x=p8[1];//数组数
				p8+=2;
				while(x--)
				{
					i=(p8[3]<<24)|(p8[4]<<16)|(p8[5]<<8)|p8[6];//继电器OAD
					if(i==OAD)
					{
						f=1;//参数变化标志
						p8[3]=0;
						p8[4]=0;
						p8[5]=0;
						p8[6]=0;
						break;
					}
					p8+=LENper_8000_129;
				}
				i=Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据)
				p8rx+=i;
			}
			if(f)
			{//参数变化标志
				MW(ADDR_DATABUFF,ADDR_8000_129,LENmax_8000_129);
			}
	#else
			UARTCtrl->DAR=255;
	#endif
			return (LenRx<<16)+LenTx;
			
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//保电
u32 ACTION_8001(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	
