gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_8000.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	
	LenRx=Get_DL698DataLen_S(p8rx+4,0);//得到DL698数据类型长度(包括:类型字节和数据)
	if(p8rx[4+LenRx]==0)
	{//无时间标签
		UARTCtrl->DAR=32;//时间标签无效          (32)
		return (LenRx<<16)+LenTx;
	}
	i=Uart_TimeTag(p8rx+4+LenRx+1);//时间标签有效性判断;入口:p8rx指向时间标签;返回:0=有效,1=无效
	if(i)
	{
		UARTCtrl->DAR=32;//时间标签无效          (32)
		return (LenRx<<16)+LenTx;
	}
	
	i=p8rx[2];
	switch(i)
	{
		case 127://方法127：投入保电（参数）参数∷=NULL
			MC(0x55,ADDR_8001_127,1);
		#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			Terminal_Contrl_Protect();//终端控制-保电
		#endif
		#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
			{
				Terminal_Contrl_Protect();//终端控制-保电
			}
		#endif
			return (LenRx<<16)+LenTx;
		case 128://方法128：解除保电（参数）参数∷=NULL
			MC(0,ADDR_8001_127,1);
		#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			Terminal_Contrl_Protect();//终端控制-保电
		#endif
		#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
			{
				Terminal_Contrl_Protect();//终端控制-保电
			}
		#endif
			return (LenRx<<16)+LenTx;
		case 129://方法129：解除自动保电（参数）参数∷=NULL
			MWR(DataType_long_unsigned,ADDR_8001_3,3);//保电-允许与主站最大无通信时长（分钟）
			MWR(DataType_long_unsigned,ADDR_8001_4,3);//保电-上电自动保电时长（分钟）
			MWR(DataType_array,ADDR_8001_5,2);//保电-自动保电时段
		#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			Terminal_Contrl_Protect();//终端控制-保电
		#endif
		#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
			{
				Terminal_Contrl_Protect();//终端控制-保电
			}
		#endif
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//催费告警
u32 ACTION_8002(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	i=p8rx[2];
	switch(i)
	{
		case 127://方法127：催费告警投入（参数）
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			if(i>LENmax_8002_127)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
			MW((u32)p8rx,ADDR_8002_127,i);
			Terminal_Contrl_Out();//终端控制-输出.继电器和LED
			return (LenRx<<16)+LenTx;
		case 128://方法128：取消催费告警（参数）参数∷=NULL
			MC(0,ADDR_8002_127,1);
			LenRx=1;
			Terminal_Contrl_Out();//终端控制-输出.继电器和LED
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//时段功控
u32 ACTION_8103(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 OI;
	u32 Array;
	u8 *p8;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	Method=p8rx[2];
	switch(Method)
	{
		case 3://添加控制单元
		case 5://更新控制单元
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			if(LenRx!=LENper_8103_2)
			{
				UARTCtrl->DAR=7;//类型不匹配           （7）
				return (LenRx<<16)+LenTx;
			}
			OI=(p8rx[3]<<8)+p8rx[4];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8103_2,LENmax_8103_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				p8[0]=DataType_array;
				p8[1]=0;
				Array=0;
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8103_2;
			}
			if(i<Array)
			{//找到
				MW((u32)p8rx,(u32)p8,LENper_8103_2);
				MW(ADDR_128KDATABUFF,ADDR_8103_2,LENmax_8103_2);
			}
			else
			{//没找到
				if(Array<NUMmax_TAG)
				{
					p8=(u8*)ADDR_128KDATABUFF;
					p8[0]=DataType_array;
					p8[1]=Array+1;
					MW((u32)p8rx,ADDR_128KDATABUFF+2+(LENper_8103_2*Array),LENper_8103_2);
					MW(ADDR_128KDATABUFF,ADDR_8103_2,LENmax_8103_2);
				}
				else
				{
					UARTCtrl->DAR=8;//越界                 （8）
				}
			}
			return (LenRx<<16)+LenTx;
		case 4://删除控单元
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8103_2,LENmax_8103_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8103_2,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8103_2;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8103_2,LENmax_8103_2);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8103_2,LENmax_8103_2);
			}
			else
			{
				UARTCtrl->DAR=6;//对象不存在           （6）
			}
	//控制投入状态
			MR(ADDR_128KDATABUFF,ADDR_8103_3,LENmax_8103_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8103_3,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8103_3;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8103_3,LENmax_8103_3);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8103_3,LENmax_8103_3);
			}
	//时段功控方案切换
			MR(ADDR_128KDATABUFF,ADDR_8103_127,LENmax_8103_127);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8103_127,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8103_127;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8103_127,LENmax_8103_127);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8103_127,LENmax_8103_127);
			}
			return (LenRx<<16)+LenTx;
		case 6://控制投入
		case 7://控制解除
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
			MR(ADDR_128KDATABUFF,ADDR_8103_3,LENmax_8103_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8103_3,2);
			}
			p8+=2;
			for(i=1;i<=Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8103_3;
			}
			if(i>Array)
			{//没找到
				Array=i;
				if(i>NUMmax_TAG)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			p8=(u8*)ADDR_128KDATABUFF;
			p8[0]=DataType_array;
			p8[1]=Array;
			i--;
			p8+=2+(i*LENper_8103_3);
			p8[0]=DataType_structure;
			p8[1]=2;
			p8[2]=DataType_OI;
			p8[3]=OI>>8;
			p8[4]=OI;
			p8[5]=DataType_enum;
			if(Method==6)
			{
				p8[6]=1;//{未投入（0），投入（1）}
			}
			else
			{
				p8[6]=0;//{未投入（0），投入（1）}
			}
			MW(ADDR_128KDATABUFF,ADDR_8103_3,LENmax_8103_3);
			return (LenRx<<16)+LenTx;
		case 127://方法127：时段功控方案切换（总加组对象，控制方案）
//时段功控方案切换∷=structure
//总加组对象∷=OI
//控制方案∷=structure
//{
//时段功控投入标识    bit-string(SIZE(8))，
//时段功控定值方案号  unsigned
//}
//时段功控投入标识：D0～D7按顺序对位表示第1～第8时段，置“1”：有效，置“0”：无效。
//时段功控定值方案号：数值范围：0～2依次表示第1～第3套方案，其他值无效。
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			if(i>LENper_8103_127)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
			OI=(p8rx[3]<<8)+p8rx[4];
			MR(ADDR_128KDATABUFF,ADDR_8103_127,LENmax_8103_127);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8103_127,2);
			}
			p8+=2;
			for(Method=1;Method<=Array;Method++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8103_127;
			}
			if(Method>Array)
			{//没找到
				Array=Method;
				if(Method>NUMmax_TAG)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			p8=(u8*)ADDR_128KDATABUFF;
			p8[0]=DataType_array;
			p8[1]=Array;
			Array--;
			MW((u32)p8rx,ADDR_128KDATABUFF+2+(Array*LENper_8103_127),LENper_8103_127);
			MW(ADDR_128KDATABUFF,ADDR_8103_127,LENmax_8103_127);
			return (LenRx<<16)+LenTx;

		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//厂休控
u32 ACTION_8104(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 OI;
	u32 Array;
	u8 *p8;
	
