gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_8000.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	Method=p8rx[2];
	switch(Method)
	{
		case 3://添加控制单元
		case 5://更新控制单元
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			OI=(p8rx[3]<<8)+p8rx[4];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8104_2,LENmax_8104_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				p8[0]=DataType_array;
				p8[1]=0;
				Array=0;
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8104_2;
			}
			if(i<Array)
			{//找到
				MW((u32)p8rx,(u32)p8,LENper_8104_2);
				MW(ADDR_128KDATABUFF,ADDR_8104_2,LENmax_8104_2);
			}
			else
			{//没找到
				if(Array<NUMmax_TAG)
				{
					p8=(u8*)ADDR_128KDATABUFF;
					p8[0]=DataType_array;
					p8[1]=Array+1;
					MW((u32)p8rx,ADDR_128KDATABUFF+2+(LENper_8104_2*Array),LENper_8104_2);
					MW(ADDR_128KDATABUFF,ADDR_8104_2,LENmax_8104_2);
				}
				else
				{
					UARTCtrl->DAR=8;//越界                 （8）
				}
			}
			return (LenRx<<16)+LenTx;
		case 4://删除控单元
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8104_2,LENmax_8104_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8104_2,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8104_2;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8104_2,LENmax_8104_2);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8104_2,LENmax_8104_2);
			}
			else
			{
				UARTCtrl->DAR=6;//对象不存在           （6）
			}
	//控制投入状态
			MR(ADDR_128KDATABUFF,ADDR_8104_3,LENmax_8104_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8104_3,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8104_3;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8104_3,LENmax_8104_3);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8104_3,LENmax_8104_3);
			}
			return (LenRx<<16)+LenTx;
		case 6://控制投入
		case 7://控制解除
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
			MR(ADDR_128KDATABUFF,ADDR_8104_3,LENmax_8104_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8104_3,2);
			}
			p8+=2;
			for(i=1;i<=Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8104_3;
			}
			if(i>Array)
			{//没找到
				Array=i;
				if(i>NUMmax_TAG)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			p8=(u8*)ADDR_128KDATABUFF;
			p8[0]=DataType_array;
			p8[1]=Array;
			i--;
			p8+=2+(i*LENper_8104_3);
			p8[0]=DataType_structure;
			p8[1]=2;
			p8[2]=DataType_OI;
			p8[3]=OI>>8;
			p8[4]=OI;
			p8[5]=DataType_enum;
			if(Method==6)
			{
				p8[6]=1;//{未投入（0），投入（1）}
			}
			else
			{
				p8[6]=0;//{未投入（0），投入（1）}
			}
			MW(ADDR_128KDATABUFF,ADDR_8104_3,LENmax_8104_3);
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//营业报停控
u32 ACTION_8105(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 OI;
	u32 Array;
	u8 *p8;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	Method=p8rx[2];
	switch(Method)
	{
		case 3://添加控制单元
		case 5://更新控制单元
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			OI=(p8rx[3]<<8)+p8rx[4];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8105_2,LENmax_8105_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				p8[0]=DataType_array;
				p8[1]=0;
				Array=0;
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8105_2;
			}
			if(i<Array)
			{//找到
				MW((u32)p8rx,(u32)p8,LENper_8105_2);
				MW(ADDR_128KDATABUFF,ADDR_8105_2,LENmax_8105_2);
			}
			else
			{//没找到
				if(Array<NUMmax_TAG)
				{
					p8=(u8*)ADDR_128KDATABUFF;
					p8[0]=DataType_array;
					p8[1]=Array+1;
					MW((u32)p8rx,ADDR_128KDATABUFF+2+(LENper_8105_2*Array),LENper_8105_2);
					MW(ADDR_128KDATABUFF,ADDR_8105_2,LENmax_8105_2);
				}
				else
				{
					UARTCtrl->DAR=8;//越界                 （8）
				}
			}
			return (LenRx<<16)+LenTx;
		case 4://删除控单元
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			OI=(p8rx[1]<<8)+p8rx[2];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8105_2,LENmax_8105_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8105_2,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8105_2;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8105_2,LENmax_8105_2);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8105_2,LENmax_8105_2);
			}
			else
			{
				UARTCtrl->DAR=6;//对象不存在           （6）
			}
	//控制投入状态
			MR(ADDR_128KDATABUFF,ADDR_8105_3,LENmax_8105_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8105_3,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8105_3;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8105_3,LENmax_8105_3);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8105_3,LENmax_8105_3);
			}
			return (LenRx<<16)+LenTx;
		case 6://控制投入
		case 7://控制解除
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
			MR(ADDR_128KDATABUFF,ADDR_8105_3,LENmax_8105_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8105_3,2);
			}
			p8+=2;
			for(i=1;i<=Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8105_3;
			}
			if(i>Array)
			{//没找到
				Array=i;
				if(i>NUMmax_TAG)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			p8=(u8*)ADDR_128KDATABUFF;
			p8[0]=DataType_array;
			p8[1]=Array;
			i--;
			p8+=2+(i*LENper_8105_3);
			p8[0]=DataType_structure;
			p8[1]=2;
			p8[2]=DataType_OI;
			p8[3]=OI>>8;
			p8[4]=OI;
			p8[5]=DataType_enum;
			if(Method==6)
			{
				p8[6]=1;//{未投入（0），投入（1）}
			}
			else
			{
				p8[6]=0;//{未投入（0），投入（1）}
			}
			MW(ADDR_128KDATABUFF,ADDR_8105_3,LENmax_8105_3);
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//当前功率下浮控
u32 ACTION_8106(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 OI;
	u32 Pn;
	u32 Array;
	u8 *p8;
	
