gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_8000.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	i=p8rx[2];
	switch(i)
	{
		case 7://7	控制解除（总加组对象）总加组对象∷=OI
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			OI=(p8rx[1]<<8)+p8rx[2];//总加组对象
			if((OI<0x2301)||(OI>(0x2300+NUMmax_TAG)))
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
	//控制投入状态
			MR(ADDR_128KDATABUFF,ADDR_8106_3,LENmax_8106_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8106_3,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8106_3;
			}
			if(i<Array)
			{//找到
				p8[6]=0;//未投入（0），投入（1）
				MW(ADDR_128KDATABUFF,ADDR_8106_3,LENmax_8106_3);
			}
			return (LenRx<<16)+LenTx;
			
		case 127://方法127 投入（总加组对象，控制方案）
//structure
//总加组对象∷=OI
//控制方案∷=structure
//{
//当前功率下浮控定值滑差时间    unsigned（单位：分钟），
//当前功率下浮控定值浮动系数    integer（单位：%），
//控后总加有功功率冻结延时时间  unsigned（单位：分钟），
//当前功率下浮控的控制时间      unsigned（单位：0.5小时），
//当前功率下浮控第1轮告警时间  unsigned（单位：分钟），
//当前功率下浮控第2轮告警时间  unsigned（单位：分钟），
//当前功率下浮控第3轮告警时间  unsigned（单位：分钟），
//当前功率下浮控第4轮告警时间  unsigned（单位：分钟）
//}
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			if(LenRx>LENper_8106_127)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
			OI=(p8rx[3]<<8)+p8rx[4];//总加组对象
			if((OI<0x2301)||(OI>(0x2300+NUMmax_TAG)))
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+0;
			}
			Pn=OI&0xff;
			Pn--;
			i=p8rx[14];//当前功率下浮控的控制时间0.5h
			i*=30;//当前功率下浮控的控制时间0.5h
			MWR(i,ADDR_TerminalFMTimer+6+(TFMSTIMER_NUM*2)+6+(Pn*2),2);
			
			MR(ADDR_128KDATABUFF,ADDR_8106_127,LENmax_8106_127);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8106_127,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8106_127;
			}
			if(i>=Array)
			{//没找到
				if(i<NUMmax_TAG)
				{
					i++;
				}
				else
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			Array=i;
			if(Array==0)
			{
				Array=1;
			}
			p8=(u8*)ADDR_128KDATABUFF;
			p8[0]=DataType_array;
			p8[1]=Array;
			Array--;
			MW((u32)p8rx,ADDR_128KDATABUFF+2+(Array*LENper_8106_127),LENper_8106_127);
			MW(ADDR_128KDATABUFF,ADDR_8106_127,LENmax_8106_127);
	//控制投入状态
			MR(ADDR_128KDATABUFF,ADDR_8106_3,LENmax_8106_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8106_3,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8106_3;
			}
			if(i<Array)
			{//找到
				p8[6]=1;//未投入（0），投入（1）
			}
			else
			{//没找到
				if(i<NUMmax_TAG)
				{
					p8=(u8*)ADDR_128KDATABUFF;
					p8[0]=DataType_array;
					p8[1]=i+1;
					p8+=2;
					p8+=LENper_8106_3*i;
					p8[0]=DataType_structure;
					p8[1]=2;
					p8[2]=DataType_OI;
					p8[3]=OI>>8;
					p8[4]=OI;
					p8[5]=DataType_enum;
					p8[6]=1;
				}
				else
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			MW(ADDR_128KDATABUFF,ADDR_8106_3,LENmax_8106_3);
			return (LenRx<<16)+LenTx;

		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//购电控
u32 ACTION_8107(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 OI;
	u32 Pn;
	u32 Array;
	u8 *p8;
	u64 d64a;
	u64 d64b;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LenTx=0;
	Method=p8rx[2];
	switch(Method)
	{
		case 3://添加控制单元
		case 5://更新控制单元
//购电控配置单元
//属性2∷=structure
//{
//	总加组对象      OI，
//购电单号        double-long-unsigned，
//追加/刷新标识   enum{追加（0），刷新（1）}，
//购电类型        enum{电量（0），电费（1）}，
//购电量（费）值  long64（单位：kWh/元， 换算：-4），
//	报警门限值      long64（单位：kWh/元，换算：-4），
//	跳闸门限值      long64（单位：kWh/元，换算：-4）
//	购电控模式      enum{本地模式（0），远程模式（1）}
//}
			p8rx+=4;
			LEN_RxAPDU-=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用（9）
				return 0;
			}
			OI=(p8rx[3]<<8)+p8rx[4];
			if((OI<0x2301)||(OI>(0x2300+NUMmax_TAG)))
			{
				UARTCtrl->DAR=255;
				return (LenRx<<16)+LenTx;
			}
			Pn=OI&0xff;
			Pn--;
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8107_2,LENmax_8107_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				p8[0]=DataType_array;
				p8[1]=0;
				Array=0;
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8107_2;
			}
			if(i<Array)
			{//找到
			#if (USER/100)!=0//不是电科院测试
				//比较购电单号
				i=MRR((u32)p8rx+6,4);
				Method=MRR((u32)p8+6,4);
				if(i==Method)
				{//购电单号相同
					UARTCtrl->DAR=255;
					return (LenRx<<16)+LenTx;
				}
			#endif
				MW((u32)p8rx,(u32)p8,LENper_8107_2);
				MW(ADDR_128KDATABUFF,ADDR_8107_2,LENmax_8107_2);
			}
			else
			{//没找到
				if(Array<NUMmax_TAG)
				{
					p8=(u8*)ADDR_128KDATABUFF;
					p8[0]=DataType_array;
					p8[1]=Array+1;
					MW((u32)p8rx,ADDR_128KDATABUFF+2+(LENper_8107_2*Array),LENper_8107_2);
					MW(ADDR_128KDATABUFF,ADDR_8107_2,LENmax_8107_2);
				}
				else
				{
					UARTCtrl->DAR=8;//越界（8）
					return (LenRx<<16)+LenTx;
				}
			}
			if(p8rx[11])
			{//刷新标识enum{追加（0），刷新（1）}
				MW((u32)p8rx+15,ADDR_230x_11+(Pn*LENper_230x_11)+1,8);
			}
			else
			{//追加
				d64a=MRR((u32)p8rx+15,8);
				d64b=MRR(ADDR_230x_11+(Pn*LENper_230x_11)+1,8);
				d64a=R_Inverse(d64a,8);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
				d64b=R_Inverse(d64b,8);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
				d64a+=d64b;
				d64a=R_Inverse(d64a,8);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
				MWR(d64a,ADDR_230x_11+(Pn*LENper_230x_11)+1,8);
			}
			//购电事件
			p8=(u8*)ADDR_128KDATABUFF+(64*1024);//产生事件用临时数据
			p8[0]=DataType_OI;//产生源
			p8[1]=OI>>8;
			p8[2]=OI;
			Event_OAD(0x32020200,p8,2,2);//标准事件记录;入口:OAD,pOccurSour产生源=0表示空,occur=0恢复=1产生=2无,OccurkWh=0恢复=1产生=2无;返回:0=没记录,1=记录;使用ADDR_DATABUFF和ADDR_128KDATABUFF
			return (LenRx<<16)+LenTx;
		case 4://删除控单元
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
	//控制方案集
			MR(ADDR_128KDATABUFF,ADDR_8107_2,LENmax_8107_2);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8107_2,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8107_2;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8107_2,LENmax_8107_2);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8107_2,LENmax_8107_2);
			}
			else
			{
				UARTCtrl->DAR=6;//对象不存在           （6）
			}
	//控制投入状态
			MR(ADDR_128KDATABUFF,ADDR_8107_3,LENmax_8107_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8107_3,2);
			}
			p8+=2;
			for(i=0;i<Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8107_3;
			}
			if((i<Array)&&(Array!=0))
			{//找到
				MR((u32)p8,(u32)p8+LENper_8107_3,LENmax_8107_3);
				p8=(u8*)ADDR_128KDATABUFF;
				Array--;
				p8[1]=Array;
				MW(ADDR_128KDATABUFF,ADDR_8107_3,LENmax_8107_3);
			}
			return (LenRx<<16)+LenTx;
		case 6://控制投入
		case 7://控制解除
			LenRx=0;
			p8rx+=4;
			LEN_RxAPDU-=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if(LEN_RxAPDU<i)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx+=i;
			OI=(p8rx[1]<<8)+p8rx[2];
			MR(ADDR_128KDATABUFF,ADDR_8107_3,LENmax_8107_3);
			//找相同的OI
			p8=(u8*)ADDR_128KDATABUFF;
			Array=p8[1];
			if(Array>NUMmax_TAG)
			{
				Array=0;
				MC(0,ADDR_8107_3,2);
			}
			p8+=2;
			for(i=1;i<=Array;i++)
			{
				if(OI==((p8[3]<<8)+p8[4]))
				{
					break;
				}
				p8+=LENper_8107_3;
			}
			if(i>Array)
			{//没找到
				Array=i;
				if(i>NUMmax_TAG)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
			}
			p8=(u8*)ADDR_128KDATABUFF;
			p8[0]=DataType_array;
			p8[1]=Array;
			i--;
			p8+=2+(i*LENper_8107_3);
			p8[0]=DataType_structure;
			p8[1]=2;
			p8[2]=DataType_OI;
			p8[3]=OI>>8;
			p8[4]=OI;
			p8[5]=DataType_enum;
			if(Method==6)
			{
				p8[6]=1;//{未投入（0），投入（1）}
			}
			else
			{
				p8[6]=0;//{未投入（0），投入（1）}
			}
			MW(ADDR_128KDATABUFF,ADDR_8107_3,LENmax_8107_3);
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

